# 1)Дан лист:
# list = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]

# - найти min число в листе
# list.sort()
# print(list[0])

# - удалить все дубликаты в листе
# del list[5]
# del list[6]
# del list[7]
# print(list)
# list.remove(5)
# list.remove(2)
# list.remove(8)
# print(list)


# - заменить каждое четвертое значение на "Х"
# del list[3]
# list.insert(3, 'x')
# del list[7]
# list.insert(7, 'x')
# print(list)

# 2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:
# a = 15
# print('*', a * '*', '*')
# print('*',  a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * ' ', '*')
# print('*', a * '*', '*')

# 3) вывести табличку умножения с помощью цикла while
# i = 1
# while i < 10:
#     j = 1
#     while j < 10:
#         print(i * j, end=' ')
#         j = j + 1
#     print()
#     i = i + 1

# 4) переделать первое задание под меню с помощью цикла
# x = int(input('Зробіть свій вибір(1-6):'))
# if x == 1:
#     print('1. найти min число в листе')
# elif x == 2:
#     print('2.удалить все дубликаты в листе')
# elif x == 3:
#     print('3.заменить каждое четвертое значение на "Х"')
# elif x == 4:
#     print('4.вывести на экран пустой квадрат из "*" сторона которого указана в переменой')
# elif x == 5:
#     print('5.вывести табличку умножения с помощью цикла while')
# elif x == 6:
#     print('6.Вихід')
# else :
#     print('Зробіть інший вибір')

#
# ***  - вывести элемент листа, значение которого ближе всего к среднему арифметическому всех элементов этого же листа
# пример:
# [1, 2, 3, 4, 5, 6, 7, 8, 9] => 5
# [-1, -2, 3, 4, 555] => 4
# [5, 5, 5, 5] => 5
# [-10, 5, 5] => 5

# list.sort()
# b = sum(list)/len(list)
# for i in list:
#     if i[i] <= b:
#        print(i[i])
#     else:
#

    # c = i-1 % b
    # a = i % b
    # if c < a:
    #     print(a)
    # else:
    #  print(c)